{
    "AccessDenied": "Vous ne disposez pas des droits pour faire cette action.",
    "ChannelNotFound": "Ce canal ne semble pas exister sur ce serveur. Merci de mentionner le canal que vous voulez configurer.",
    "ErrorTxt": "Oops ! J'ai rencontré une erreur. Si celle-ci persiste, contactes un administrateur.",
    "NotUnderstoodTxt": "Je n'ai pas compris ton message. Peux-tu le vérifier et le renvoyer ?",
    "RoleNotFound": "Ce rôle ne semble pas exister sur ce serveur. Merci de mentionner le rôle que vous voulez configurer.",
    "SuccessConfig": "La configuration est terminée. Merci de votre aide.",

    "BirthdayTxt": {
        "AlreadySetup": "Mon service \"Annonce des anniversaires\" est configuré de la façon suivante :\r",
        "AlreadyRegistered": "Votre anniversaire est déjà enregistré.",
        "AskChannel": "Mentionnez le canal dans lequel je dois annoncer les anniversaires.",
        "AskEnableAuto": "Voulez-vous que je fasse une annonce automatiquement dès qu'un membre a son anniversaire ? (yes/no)\rVous pourrez toujours activer ou désactiver cette fonction en utilisant les commandes `!bd go` ou `!bd stop`.",
        "AskMessage": "Quel message dois-je utiliser pour souhaiter un joyeux anniversaire ?\rVous pouvez utiliser les expressions suivantes pour personnaliser le message :\r`{name}` : m'indique que je devrai mettre le nom du membre dont c'est l'anniversaire.\rExemple de message : \"Joyeux anniversaire {name} !!\"\rSi vous avez besoin de plus de paramètres personnalisables, n'hésitez pas à en faire part au support.",
        "AskModifyChannel": "Si vous voulez modifier le canal, mentionnez le nouveau canal que je devrai utiliser, sinon tapez `!bd next`.",
        "AskModifyCurrentSetup": "Voulez-vous modifier cette configuration ? (yes/no)",
        "AskModifyMessage": "Si vous voulez modifier le message, écrivez le nouveau message que je devrai utiliser, sinon tapez `!bd next`.",
        "AutoAnnouncementDisabled": "Je ne ferai plus d'annonce à l'anniversaire d'un des membres du serveur.",
        "AutoAnnouncementEnabled": "Je ferai automatiquement une annonce à l'anniversaire d'un des membres du serveur.",
        "BirthdayAddConfirm": "Votre anniversaire a bien été ajouté.",
        "BirthdayChannel": "Canal que j'utilise pour annoncer les anniversaires : ",
        "BirthdayDeleteConfirm" : "Votre anniversaire a bien été supprimé.",
        "BirthdayMessage": "Message d'anniversaire :\r",
        "BirthdayMessageHour": "Heure à laquelle je poste le message : ",
        "BirthdayNotFound": "Vous n'avez pas d'anniversaire enregistré.",
        "Help": "Le service \"Annonce des anniversaires\" vous permet d'envoyer automatiquement un message personnalisé lorsque l'un de vos membres a son annivesaire.\rAvant de pouvoir l'utiliser, il faut le configurer. Pour cela, utilisez la commande `!bd setup` et laissez vous guidez. Au préalable, il vous faudra décider et créer le case échéant le canal d'annonce.\rLes membres peuvent ajouter leur anniversaire avec la commande `!bd add {dd/mm}` avec {dd/mm} la date d'anniversaire. Ils peuvent aussi supprimer leur anniversaire avec `!bd remove`.\rSi vous avez des problèmes avec ce service, n'hésitez pas à contacter le support.\rPour activer la fonction d'annonce automatique, utilisez `!bd go` ; pour la désactiver, utilisez `!bd stop`.",
        "IncorrectDate": "La date entrée est incorrecte. Merci de respecter le format DD/MM (par exemple 31/01).",
        "NoSetup": "Votre serveur n'est pas encore configuré pour utiliser mon service \"Annonce des anniversaires\". Voulez-vous le configurer maintenant ? (yes/no)",
        "Channel": "Channel : ",
        "Message": "Message d'annonce :\r",
        "UpdateDone": "La mise à jour a bien été faite."
    },

    "Help": {
        "AdminHelp": "- `!blanco admin` : crée ou modifie les rôles administrateurs pour Blanco.\r- `!blanco help` : affiche l'aide de la fonctionnalité Admin.",
        "AdminTitle": "Admin",
        "BirthdaysHelp": "- `!bd setup` : crée ou modifie la configuration pour la fonctionnalité Anniversaires (canal d'annonce et message d'anniversaire).\r- `!bd go` : active le message d'anniversaire automatique.\r- `!bd stop` : désactive le message d'anniversaire automatique.\r- `!bd add {DD/MM}` : ajoute la date comme date d'anniversaire de l'auteur du message. La date doit être au format JJ/MM (par exemple `!bd add 31/01`).\r- `!bd remove` : retire l'anniversaire de l'auteur.\r- `!bd help` : affiche l'aide de la fonctionnalité Anniversaires.",
        "BirthdaysTitle": "Anniversaires",
        "MusicHelp": "- `!m play {youtube_url}` : joue la musique où pointe l'URL. Vous devez être dans un canal vocal pour exécuter cette commande. Par exemple `!m play https://youtu.be/dQw4w9WgXcQ`.\r- `!m pause` : met en pause la lecture en cours. Vous devez être dans le même canal vocal que Blanco.\r- `!m resume` : reprend la lecture en pause le cas échéant. Vous devez être dans le même canal vocal que Blanco.\r- `!m skip` : passe à la musique suivante dans la liste de lecture. Vous devez être dans le même canal vocal que Blanco.\r- `!m stop` : arrête la lecture et Blanco quitte le canal vocal. Vous devez être dans le même canal vocal que Blanco.\r- `!m help` : affiche l'aide de la fonctionnalité Music.",
        "MusicTitle": "Musique",
        "ReactionRolesHelp": "- `!rr create` : crée ou modifie un menu reaction roles.\r- `!rr modify` : modifie un menu reaction roles. Vous devez répondre au menu que vous voulez modifier.\r- `!rr delete` : supprime un menu reaction roles. Vous devez répondre au menu que vous voulez supprimer.\r- `!rr add` : ajoute un rôle à un menu reaction roles. Vous devez répondre au menu auquel vous voulez ajouter un rôle.\r- `!rr remove {@role}` : retire le rôle donné dans la commande d'un menu reaction roles. Vous devez répondre au menu duquel vous voulez retirer le rôle. Par exemple, répondez à un menu reaction roles avec `!rr remove @myRole`.\r- `!rr help` : affiche l'aide de la fonctionnalité Reaction roles.",
        "ReactionRolesTitle": "Reaction roles",
        "StreamHelp": "- `!str setup` : crée ou modifie la configuration pour les annonces des streams Twitch.\r- `!str go` : active les messages d'annonce automatiques de Blanco quand un membre commence à streamer sur Twitch.\r- `!str stop` : désactive les messages d'annonce automatiques de Blanco quand un membre commence à streamer sur Twitch.\r- `!str help` : affiche l'aide de la fonctionnalité Stream.",
        "StreamTitle": "Stream",
        "MsgTitle": "Liste des commandes",
        "MsgDescription": "Voici la liste de mes commandes pour la version actuelle (v2.1.0) :"
    },

    "MemberMgerTxt": {
        "AlreadySetup": "Mon service \"Vérification des nouveaux membres\" est configuré de la façon suivante :\r",
        "AskChannel": "Mentionnez le canal dans lequel les nouveaux membres doivent valider leur entrée.",
        "AskEnableAuto": "Voulez-vous que j'envoie régulièrement un message aux nouveaux membres qui n'ont pas encore validé leur entrée ? (yes/no)\rVous pourrez toujours activer ou désactiver cette fonction en utilisant les commandes `!mm go` ou `!mm stop`.",
        "AskMessage": "Quel message dois-je utiliser pour rappeler aux nouveaux membres qu'ils doivent valider leur entrée sur votre serveur ?\rExemple de message : \"Bonjour, je t'invite à réagir au message dans le canal Bienvenue pour gagner l'accès au reste du serveur.\"\rSi vous avez besoin de plus de paramètres personnalisables, n'hésitez pas à en faire part au support.",
        "AskModifyChannel": "Si vous voulez modifier le canal, mentionnez le nouveau canal que je devrai utiliser, sinon tapez `!mm next`.",
        "AskModifyCurrentSetup": "Voulez-vous modifier cette configuration ? (yes/no)",
        "AskModifyMessage": "Si vous voulez modifier le message, écrivez le nouveau message que je devrai utiliser, sinon tapez `!mm next`.",
        "AutoAnnouncementDisabled": "Je n'enverrai plus de messages aux nouveaux membres.",
        "AutoAnnouncementEnabled": "J'enverrai automatiquement des messages aux nouveaux membres pour qu'ils valident leur entrée.",
        "Help": "Le service \"Vérification des nouveaux membres\" vous permet d'envoyer automatiquement chaque semaine un message de rappel personnalisé aux nouveaux membres qui n'auraient pas validé leur entrée.\rAvant de pouvoir l'utiliser, il faut le configurer. Pour cela, utilisez la commande `!mm setup` et laissez vous guider. Au préalable, il vous faudra décider et créer le cas échéant le canal de bienvenue.\rSi vous avez des problèmes avec ce service, n'hésitez pas à contacter le support.\rPour activer la fonction d'annonce automatique, utilisez `!mm go` ; pour la désactiver, utilisez `!mm stop`.",
        "NoSetup": "Votre serveur n'est pas encore configuré pour utiliser mon service \"Vérification des nouveaux membres\". Voulez-vous le configurer maintenant ? (yes/no)",
        "Channel": "Channel de bienvenue : ",
        "Message": "Message de rappel :\r"
    },
    
    "MusicTxt": {
        "Bye": "Au revoir !",
        "Current": "*(En cours) ",
        "EmptyPlaylist" : "Il n' y a plus de musique en attente de lecture. Au revoir !",
        "Help": "Voici les différentes fonctions de la catégorie musique :\r- `!m` `play` `youtube_video_url` : lit la piste audio de la vidéo dans le canal vocal où tu es connecté\r- `!m` `pause` : met en pause la lecture\r- `!m` `resume` : reprend la lecture en pause\r- `!m` `skip` : passe à la vidéo suivante ; s'il n'y en a aucune en attente, arrête la lecture et quitte le canal vocal\r- `!m` `stop` : arrête la lecture et quitte le canal vocal\rSi vous avez des questions ou rencontrez des problèmes, n'hésitez pas à en faire part aux administrateurs.",
        "MusicAddedToPlaylist": " a été ajouté à la liste de lecture.",
        "NoNowPlaying": "Il n'y a aucune musique en cours de lecture.",
        "NoPausedMusic": "Il n'y a aucune musique en pause.",
        "NoPermissions": "J'ai besoin des permissions de me connecter et de parler dans ton canal vocal pour jouer de la musique. Contactes un administrateur.",
        "NotInSameVoiceChannel": "Tu dois être dans le même channel que moi pour exécuter cette action.",
        "NotInVoiceChannel": "Tu dois d'abord te connecter à un canal vocal",
        "NowPlaying": "Lecture en cours : ",
        "Playlist": "**__Liste de lecture :__**\n",
        "URLNotFound" : "Je n'ai pas trouvé l'URL demandée."
    },

    "ReactionRolesTxt": {
        "AddRoleDone": "Le rôle a bien été ajouté au menu.",
        "AskChannelForMenu": "Mentionnez le canal dans lequel vous voulez poster votre menu.",
        "AskRolesToAdd": "Quels rôles voulez-vous ajouter ?\rTapez `!rr next` quand vous avez fini.",
        "AskValidation": "Tapez `!rr val` pour valider le menu ou `!rr end` pour annuler la création du menu.",
        "CancelMenu": "Arrêt de la création de menu. Aucun rôle configuré.",
        "ChannelFound": "J'ai trouvé le canal. Je vais poster le menu. Merci pour votre aide !",
        "CreationStep1": "Création du menu d'attribution des rôles...\rD'abord la description :\r- en 1 ou plusieurs messages\r- tapez `!rr next` quand vous avez fini la description.\r- tapez `!rr end` pour annuler la création du menu.",
        "CreationStep2": "Passons aux rôles maintenant.",
        "CurrentMenu": "Voici le menu reaction roles actuel :",
        "DeleteConfirm": "Voulez-vous vraiment supprimer ce menu ? (yes/no)\rCette action est irréversible. ",
        "DeleteRoleConfirm": "Voulez-vous vraiment supprimer ce rôle du menu ? (yes/no)\rCette action est irréversible. ",
        "DeleteDone": "Le menu a bien été supprimé.",
        "DeleteRoleDone": "Le rôle a bien été supprimé du menu.",
        "Help": "Le menu reaction roles vous permet de créer un menu auquel les membres de votre serveur réagissent pour s'attribuer des rôles.\rPour créer un nouveau menu, utilisez la commande `!rr create` et laissez vous guider. Lorsque c'est indiqué, vous pouvez utiliser `!rr end` pour annuler ou terminer la création du menu.\rPour modifier ou supprimer un menu reaction roles, répondez au menu à modifier/supprimer et tapez la commande `!rr modify` ou `!rr delete`. Attention, la modification ne porte que sur la description du menu. Pour ajouter ou supprimer des rôles, utilisez les commandes `!rr add` et `!rr remove`.\rPour ajouter un rôle à un menu, répondez au menu avec la commande `!rr add`.\rPour retirer un rôle du menu, répondez au menu avec `!rr remove @role` avec `@role` le rôle à retirer. Une fois la suppression faite, il est conseillé de faire un `!rr modify` pour corriger le texte du menu.", 
        "MenuPreview": "Voici à quoi ressemblera le menu des rôles :",
        "MessageExample": "Par exemple :\rVous voulez devenir un @bot ? Réagissez avec 🤖",
        "MessageExampleReaction": "🤖",
        "RoleRules": "Voici quelques règles :\r- 1 message par rôle\r- Pensez à mentionner le rôle dans le message et indiquer l'émoticône à utiliser pour s'attribuer ce rôle.\r- **Réagissez au message** avec l'émoticône à utiliser\r- Tapez `!rr next` quand vous avez fini.",
        "SanitizedMenu": "J'ai affiché les caractères utilisés pour la mise en forme, comme ça tu peux recopier le message et faire tes modifications plus facilement. Envoie `!rr next` quand tu as fini pour que je mette à jour le menu."
    },

    "Setup": {
        "AdminRolesList": "Voici la liste des rôles d'administrateurs :",
        "AdminSetupEnd": "La configuration des rôles administrateurs est terminée.",
        "AskAdminRolesModification": "Pour ajouter ou supprimer un rôle, utilisez `!blanco add` ou `!blanco remove` suivi de la mention du rôle à ajouter/retirer.\rVouspouvez en ajouter ou supprimer autant que vous voulez. Tapez `!blanco next` quand vous avez fini toutes vos modifications.",
        "AskAdminRoleToAdd": "Quel rôle voulez-vous ajouter en tant qu'administrateur ?\rTagguez simplement le rôle et envoyez le message (un seul message par rôle).\rTapez `!blanco next` quand vous avez fini.",
        "AskModifyAdminRoles": "Des rôles d'administrateurs sont déjà configurés, voulez-vous les modifier ? (yes/no)",
        "AskSetupAdminRole": "Les rôles d'administrateurs ne sont pas définis. Voulez-vous les définir maintenant ? (yes/no)",
        "Help" : "La commande `!blanco admin` permet de gérer les rôles que je considère comme administrateurs votre serveur afin que je puisse l'utiliser au mieux.\rLes rôles d'administrateurs ont le droit de modifier ma configuration pour ce serveur et d'accéder à certaines fonctionnalités.\rVous avez besoin du rôle d'administrateur pour les commandes suivantes : `!blanco admin`, `!str setup`, `!str go`, `!str stop`, `!bd setup`, `!bd go`, `!bd stop`, `!rr create`, `!rr modify`, `!rr delete`, `!rr add`, `!rr remove`.",
        "RoleAlreadyAdmin": "Ce rôle est déjà enregistré en tant qu'administrateur.",
        "RoleIsNotAdmin": "Ce rôle n'est pas enregistré en tant qu'administrateur",
        "RoleNotFoundInGuild": "Ce rôle ne semble pas exister sur ce serveur.",
        "RoleSuccessfullyAdded": "Le rôle a bien été ajouté en tant qu'adminsitrateur.",
        "RoleSuccessfullyRemoved": "Le rôle a bien été retiré des rôles adminsitrateurs."
    },

    "StreamTxt": {
        "AlreadySetup": "Mon service \"Annonce de stream Twitch\" est configuré de la façon suivante :\r",
        "AskChannel": "Mentionnez le canal dans lequel je dois annoncer le début d'un stream.",
        "AskEnableAuto": "Voulez-vous que je fasse une annonce automatiquement dès qu'un membre commence un stream sur Twitch ? (yes/no)\rVous pourrez toujours activer ou désactiver cette fonction en utilisant les commandes `!str go` ou `!str stop`.",
        "AskMessage": "Quel message dois-je utiliser pour annoncer le steam ?\rVous pouvez utiliser les expressions suivantes pour personnaliser le message :\r`{name}` : m'indique que je devrai renseigner le pseudo du membre qui streame.\r`{url}` : m'indique que je devrai renseigner l'url du stream.\rExemple de message : \"Salut à tous ! {name} est en train de streamer ! Rendez-vous ici : {url} !\"\rSi vous avez besoin de plus de paramètres personnalisables, n'hésitez pas à en faire part au support.",
        "AskModifyChannel": "Si vous voulez modifier le canal, mentionnez le nouveau canal que je devrai utiliser, sinon tapez `!str next`.",
        "AskModifyCurrentSetup": "Voulez-vous modifier cette configuration ? (yes/no)",
        "AskModifyMessage": "Si vous voulez modifier le message, mentionnez le nouveau message que je devrai utiliser, sinon tapez `!str next`.",
        "AskModifyRole": "Si vous voulez modifier le rôle, mentionnez le nouveau rôle que je devrai utiliser, sinon taper `!str next`.",
        "AskRole": "Mentionnez le rôle qui est attribué lorsqu'un des membres commence à streamer sur Twitch.",
        "AutoAnnouncementDisabled": "Je ne ferai plus d'annonce dès qu'un des membres du serveur commence un stream sur Twitch.",
        "AutoAnnouncementEnabled": "Je ferai automatiquement une annonce dès qu'un des membres du serveur commence un stream sur Twitch.",
        "Help": "Le service \"Annonce de stream Twitch\" vous permet d'envoyer automatiquement un message d'annonce dans un canal dès qu'un de vos membres commence un stream sur Twitch.\rAvant de pouvoir l'utiliser, il faut le configurer. Pour cela, utilisez la commande `!str setup` et laissez vous guider. Au préalable, il vous faudra décider et créer le cas échéant le canal d'annonce et le rôle que les streamers Twitch ont lorsqu'ils sont en stream.\rSi vous avez des problèmes avec ce service, n'hésitez pas à contacter le support.\rPour activer la fonction d'annonce automatique des streams, utilisez `!str go` ; pour la désactiver, utilisez `!str stop`.",
        "NoSetup": "Votre serveur n'est pas encore configuré pour utiliser mon service \"Annonce de stream Twitch\". Voulez-vous le configurer maintenant ? (yes/no)",
        "StreamChannel": "Canal que j'utilise pour annoncer les streams : ",
        "StreamMessage": "Message d'annonce de stream :\r",
        "StreamerRole": "Rôle de streamer : ",
        "Channel": "Canal que j'utilise pour annoncer les streams : ",
        "Message": "Message d'annonce de stream :\r",
        "Role": "Rôle de streamer : "
    }


}