{
    "StreamTxt": {
        "AlreadyConfig": "Il y a déjà une configuration pour mon service d'annonce de stream sur ton serveur. Voici les paramètres :",
        "AskChannel": "Ok, ensuite il me faut l'identifiant du canal dans lequel tu veux que j'annonce le stream.\rTu peux le trouver en faisant un clic droit sur le canal et \"Copier l'identifiant\".",
        "AskMessage": "Merci. Encore une dernière information : peux-tu m'écrire le message que je dois utiliser pour annoncer le steam ?\rTu peux utiliser les expressions suivantes pour personnaliser le message :\r`{name}` : m'indique que je devrai renseigner le pseudo du membre qui streame\r`{url}` : m'indique que je devrai renseigner l'url du stream\rUn exemple de message : \"Salut à tous ! {name} est en train de streamer ! Rendez-vous ici : {url} !\"\rSi tu as besoin de plus de paramètres personnalisables, n'hésites pas à en faire par à mon support.",
        "AskNewChannel": "Quel est l'identifiant du canal dans lequel tu veux que j'annonce le stream.\rTu peux le trouver en faisant un clic droit sur le canal et \"Copier l'identifiant\".",
        "AskNewMessage": "Quel est le message que je dois utiliser pour annoncer le steam ?\rTu peux utiliser les expressions suivantes pour personnaliser le message :\r`{name}` : m'indique que je devrai renseigner le pseudo du membre qui streame\r`{url}` : m'indique que je devrai renseigner l'url du stream\rUn exemple de message : \"Salut à tous ! {name} est en train de streamer ! Rendez-vous ici : {url} !\"\rSi tu as besoin de plus de paramètres personnalisables, n'hésites pas à en faire par à mon support.",
        "AskNewRole": "Quel rôle est attribué lorsqu'un de tes membres commence à streamer sur Twitch ?",
        "AskRole": "D'abord quel rôle est attribué lorsqu'un de tes membres commence à streamer sur Twitch ?",
        "AskWhatToModify": "Que veux tu modifier ? Entre une de ces commandes : `role`, `channel`, `message`, `end` (pour terminer les modifications).",
        "ChannelNotFound": "Je ne retrouve pas le canal qui m'a été donné lors de la configuration...",
        "NoConfig": "Il n'existe pas encore de configuration pour mon service d'annonce de stream. Configurons-la tout de suite !",
        "StreamingChannel": "Le canal où j'annonce le stream : ",
        "StreamingMessage": "Le message d'annonce que j'affiche : ",
        "StreamingRole": "Le rôle du membre qui est en stream sur Twitch : ",
        "SuccessConfig": "La configuration est terminée. Merci de ton aide."
    },

    "MusicTxt": {
        "Bye": "Au revoir !",
        "Current": "*(En cours) ",
        "EmptyPlaylist" : "Il n' y a plus de musique en attente de lecture. Au revoir !",
        "Help": "Voici les différentes fonctions de la catégorie musique :\r- `!m` `play` `youtube_video_url` : lit la piste audio de la vidéo dans le canal vocal où tu es connecté\r- `!m` `pause` : met en pause la lecture\r- `!m` `resume` : reprend la lecture en pause\r- `!m` `skip` : passe à la vidéo suivante ; s'il n'y en a aucune en attente, arrête la lecture et quitte le canal vocal\r- `!m` `stop` : arrête la lecture et quitte le canal vocal\rSi vous avez des questions ou rencontrez des problèmes, n'hésitez pas à en faire part aux administrateurs.",
        "MusicAddedToPlaylist": " a été ajouté à la liste de lecture.",
        "NoNowPlaying": "Il n'y a aucune musique en cours de lecture.",
        "NoPausedMusic": "Il n'y a aucune musique en pause.",
        "NoPermissions": "J'ai besoin des permissions de me connecter et de parler dans ton canal vocal pour jouer de la musique. Contactes un administrateur.",
        "NotInSameVoiceChannel": "Tu dois être dans le même channel que moi pour exécuter cette action.",
        "NotInVoiceChannel": "Tu dois d'abord te connecter à un canal vocal",
        "NowPlaying": "Lecture en cours : ",
        "Playlist": "**__Liste de lecture :__**\n",
        "URLNotFound" : "Je n'ai pas trouvé l'URL demandée."
    },

    "ReactionRoles": {
        "AskChannelForMenu": "Dans quel canal voulez-vous poster votre menu ?\r(Copiez et collez l'identifiant du canal)",
        "CancelMenu": "Arrêt de la création de menu. Aucun rôle configuré.",
        "ChannelFound": "Ok, j'ai trouvé le canal. Je vais poster le menu. Merci pour votre aide !",
        "CreationStep1": "Création du menu d'attribution des rôles...\rD'abord la description :\r- en 1 ou plusieurs messages\r- tapez `!rr next` quand vous avez fini la description.\r- tapez `!rr end` pour annuler la création du menu",
        "CreationStep2": "Ok, j'ai la description du menu. Passons aux rôles. Voici quelques règles :\r- 1 message par rôle\r- Pensez à mentionner le rôle dans le message et indiquer l'émoticône à utiliser pour s'attribuer ce rôle.\r- **Réagissez au message** avec l'émoticône à utiliser\r- Tapez \"!rr end\" quand vous avez fini.",
        "MenuPreview": "Voici à quoi ressemblera le menu des rôles. Tapez \"!rr val\" pour valider le menu. Si vous ne validez pas au bout de 1 minute, le menu s'autodétruira.",
        "MessageExample": "Par exemple :\rVous voulez devenir un @bot ? Réagissez avec 🤖",
        "MessageExampleReaction": "🤖"
    },

    "ErrorTxt": "Oops ! J'ai rencontré une erreur. Si celle-ci persiste, contactes un administrateur.",
    "NotUnderstoodTxt": "Je n'ai pas compris ton message. Peux-tu le vérifier et le renvoyer ?"
}